generator/content/blog/websites/index.html

<div id="outline-container-org8cd0bea" class="outline-2">
<h2 id="org8cd0bea">Website recommendations</h2>
<div class="outline-text-2" id="text-org8cd0bea">
<p>
Here is list of various websites I consider interesting and worth looking at. These
websites are owned and managed by people unrelated to me and their opinions do not
necessarily reflect my own.
</p>

<p>
<a href="http://verisimilitudes.net">http://verisimilitudes.net</a> - A blog with articles about computing, programming and other topics.
</p>
</div>
</div>
